---
type: DockablePane
namespace: Autodesk.Revit.UI
version: 2024
members: 11
tags: [revit-api, class]
---

# DockablePane

`Autodesk.Revit.UI.DockablePane` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DockablePane | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetTitle | 2014 | `public string GetTitle ()` |
| Method | Hide | 2014 | `public void Hide ()` |
| Method | IsShown | 2015 | `public bool IsShown ()` |
| Method | PaneExists | 2014 | `public static bool PaneExists ( DockablePaneId id )` |
| Method | PaneIsBuiltIn | 2014 | `public static bool PaneIsBuiltIn ( DockablePaneId id )` |
| Method | PaneIsRegistered | 2014 | `public static bool PaneIsRegistered ( DockablePaneId id )` |
| Method | Show | 2014 | `public void Show ()` |
| Property | Id | 2014 | `public DockablePaneId Id { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |